{
	"transcriptData": {
			"status": "success",
			"db_id": "4aa928ed-958e-4af7-a7c4-f797588ab297",
			"search_videos": [
					{
							"videoId": "2YehgC211UM",
							"title": "NATTY OR NOT MIKE O&#39;HEARN",
							"thumbnail": "https://i.ytimg.com/vi/2YehgC211UM/hqdefault.jpg",
							"blocks": [
									{
											"blockId": 0,
											"text": " Mike O'Hearn natty or not. Welcome back\nto Jon Sheppard fitness today as the last video did quite well with matt does\nfitness if you have seen it go and check out now the link is down below in the\ndescription so a thought I do another one and the person who came up was Mike O'Hearn if you don't know who Mike O'Hearn is he is probably other than Arnold\nSchwarzenegger one of the most famous Fitness people ever he has been on\nnumerous magazine covers I think about 400 and only arnie has been on more he has\nbeen on TV he's been a gladiator yes on TV he's done movies he's done everything\nyeah now he's on to doing speeches in front of people but the one thing that\nhe claims is he is a natural and I'm gonna go through what I think I'm not\ngoing to tell you if he's natural or not yet but what I'm gonna be doing is I'm\ngonna be doing it on a biased opinion of it but I'm not doing this for anything\nelse but to help people understand that whether you have people on YouTube the\nindustry and you look up to him they might be misleading and telling you a\nlie you know saying they're natural and you buy stuff offer because you want to\nbe like them because you think you're gonna be actually like them in years to\ncome you know get their bodies and you never got to because there aren't so\nmuch gear steroids that it's impossible and I'm also here to stick up for the\npeople who get named as a fake Nattys like I did with map\nthose fitness and I stick up for thinking they are game slated saying\nthey are on steroids when actually they are not they just work hard and I've got\ngood genetics most of the people I talk about I will like and I do follow and\ndoesn't make a difference if there are steroids or not they still work hard in\nthe gym they still up successful they're still good people to follow if you're\nliking tips and that but some people you just got to be careful of actually\nwatching what they say because you know what nowadays it doesn't really make a\ndifference if you are on steroids or not it's just it's just stupid why you would\nnot just say you know it's not as bad as the old days where you can look down on\npeople who took steroids you know so then Mike O'Hearn he is probably one of the\nmost famous people in Fitness he has been around for years and years and\nyears started in the 80s bodybuilder as you can see by the pictures of when he\nwas young he had a good physique I mean he thinks these pictures are real and\nout of the actual age I mean he's got a good body I have that's never seen a kid\nwas set for a few genetic freaks who have had a body that good as you can see\nby the time he was 21 he was competing and he had a very good physique I\nactually think he was a natural at this stage I don't think he was nothing\nspecial you know yes he had had very good physique but I don't think he was\non anything to make him stand out from the rest the thing is with like I heard\nhe is 6 foot 3 he's no little person he isn't like most professional\nbodybuilders where hold me about five foot eight he is a\nbig guy so to feel that mass to feel that body full of muscle will be hard do\nyou always say when you're taller he is actually harder to build the whole of\nthe body and because it's small to build up on and his inspiration was Arnie\nbecause it's very similar size you know height wise I know not as the Arnie was\nnot as tall as him but he related to him but as you could see through the years\nhe seems to get better I mean not many people get better with age he is getting\nbetter hair my cousin now who is 50 compared to Mike O'Hearn\nthen in his peak I would say you would say 20 25 to 30 that is the peak I would\nsay in bodybuilding and he would destroy that younger version of himself so he is\ndefinitely on something I don't know I am no expert in like steroids I've never\ntaken it I wouldn't have know the first thing about those well obviously you\ndon't have to take so is to know the actual signs of actual steroid use or\nPsalms use you know but back in them days\nthey don't have sobs it's just a new thing that is and he is always in good\nshape I mean he is always in good shape he is never fat he's never got a belly\non him he's always chiseled he's always ripped and for somebody to\nmaintain that all the time it is hard yeah you can't do it but the\nthing is when you get older obviously your testosterone your growth starts to\nslow down so it doesn't matter how much you actually work out it's harder to\nkeep the muscle and as you can see in the pictures he's actually getting\nbigger he is at the moment about 260 pounds if you want to put that\nin comparison he's bigger than most Olympia people on stage is set for the\nactually big boys like car thieves like Phil Oh Phil Heath and all of em blah\nhe's bigger than Chris Bumstead he's bigger than all of him he could probably\ngo up stage and compete with them and probably beat them if he wanted to but\nhe wouldn't even be allowed to actually compete in that category because they'd\neven be too heavy so you just got to think how many people at 50 do you know\nor ever ever sin that size that big that's shredded not many not many at all\nand so my conclusion is he is definitely on stories I don't think he's on a lot\npersonally I think he's just on a very mild cycle of something maybe does a\ncycle for a while then goes off a cycle or he might just take a certain cycle\nall year round I don't know he's nothing he's not on\ncrazy amounts because obviously he would he get even bigger he's just taking it\nto maintain the muscle mass of what he's got but still where credit is due\nhe still looks good I mean what person what wouldn't want to look like him at\n50 I mean he's got the body of a god and he's a good-looking bloke you know even\nthough we know you're doing Botox on your face Mike but still fair play to\nyou you are great in what you do everybody does he excels in it he makes\nmoney out of it he does effort he's a great person to actually follow if\nyou're thinking about making businesses grow and open because he knows his store\nso then Michael hood is definitely a fake natty and he's on something jhula\nmean he's a bad person obviously he has been very very\nsuccessful in what he's done and he just wants to keep what he's got right then\nthank you for watching if it's anybody you want me to do a review on comment\ndown below if you're new dis subscribe and give you a like if you like this see you"
									}
							],
							"summaries": [
									{
											"blockId": 0,
											"summary": "In this section, the speaker talks about famous fitness personality Mike O'Hearn and whether or not he is natural. While the speaker acknowledges O'Hearn's impressive achievements and physique, he ultimately concludes that O'Hearn is not natural and is likely on some form of mild steroid cycle to maintain his muscle mass. The speaker emphasizes the importance of being cautious about blindly following fitness personalities and not falling for potentially misleading claims of naturalness. He also notes that while O'Hearn may not be a natural, he still works hard and is an inspiration in the fitness industry. Lastly, the speaker invites viewers to suggest other personalities they would like him to review in the future."
									}
							]
					},
					{
							"videoId": "N9QA5ddzBEs",
							"title": "Mike O&#39;Hearn - The #1 myth in this world..",
							"thumbnail": "https://i.ytimg.com/vi/N9QA5ddzBEs/hqdefault.jpg",
							"blocks": [
									{
											"blockId": 1,
											"text": " Mike O'Hearn"
									}
							],
							"summaries": [
									{
											"blockId": 1,
											"summary": "In this section, the speaker is introducing Mike O'Hearn, a fitness and bodybuilding celebrity who has won numerous bodybuilding titles and acted in TV shows and movies. They discuss how Mike has maintained his impressive physique over the years through a combination of hard work, consistency, and a healthy lifestyle. They also mention his dedication to helping others achieve their fitness goals through his training programs and motivational speaking engagements."
									}
							]
					},
					{
							"videoId": "_5N5jgWapfk",
							"title": "Steroids | Fake Nattys &amp; Valuable Lessons with Mike O&#39;Hearn",
							"thumbnail": "https://i.ytimg.com/vi/_5N5jgWapfk/hqdefault.jpg",
							"blocks": [
									{
											"blockId": 2,
											"text": " So today, we're gonna be talking about something on everyone's mind You saw the title you know I'm talking about steroids, and who's taking on man who's faking them? And really telling you why you shouldn't care who's taking them, so if you follow social media You'll see that many popular guys do claim that they're natural. We don't have the right to doubt him immediately I know David later recently put out a video about his natural transformation. I haven't watched it but Generation I just put out this video with Mike O'Hearn the Titan and Sugar Baby Shawn \"Sugar\" Ray Spice So the title is the reason Mike O'Hearn stays all-natural well, I want to watch the video and talk about a little bit What they talk about and then afterwards I'm gonna give my own thoughts about what I think about steroids I? Love it funky Welcome back to the breakdown a show about bodybuilding fitness and all things generation iron I am your host Tiffany all day with my co-host Sean Ray and today We have if you don't know Michael Hearn. He's kind of done a lot of things was a bodybuilder powerlifter He's modeling and book covers and immediately I went into the comments and see what everyone else was saying Michael trend Classic are just straight up. I hate this guy. This is probably one of the best ones Yeah, I started competing puberty before puberty yeah And I was already powerlifting so by 19 I was winning mens shows and powerlifting So the main thing that he was saying about why he wasn't taking steroids is health reasons and obviously that's a valid reason So you've been around for a hot minute when did you start working out and where'd you come from we come from it was early? Early 90s I came down Joe Weider brought me down the man When he was younger after a photo shoot Joe Weider the head guy of the Joe Weider you guys you guys know Joe Weider So the man told them not to change not to take steroids essentially because he already looked amazing so during his interview he talked about how he started doing sports when he was younger and Training with weights growing up now of that the longevity of him just working out using weights doing sports is Extremely extremely useful when you later on try to do bodybuilding because your muscles are ready to develop your body's already Developed before people that had something I was 176 year and a half later. I was 272 you're talking about a Sophomore in school. I was a monster. I was already mentioned over 400 pounds by the time. I was 15 yeah squatting 550 pounds and then especially he's like six something so Being tall being thick already when you're a teenager you could tell on teenagers kids when they're gonna be freaking huge Because they're pretty much already huge, and I'm sure this is how he was when he was growing up What did I look like before puberty? Yeah, you are a man-child and back then like you said you got started in your early teens with the foundation I started it eight yeah the foundation was uh you gotta convince me on the whole thing So they're doing an interview right they asked him a question. They're talking about his background right. He's talking about his background and then Shawn ray oh, no, you got to tell me oh You don't you don't gotta tell me I know Bitch, it's not about you Okay, oh and by the way I saw a comment that Mike O'Hearn is starting to look like Rich Pianos, his face alittle bit Are the perfect thing buddy and that's from Joe Weider to me yeah, and I was like I'm done That's all you need done Yes And then I saw the harshness of what the other stuff does so he's claiming that he's always stayed natural mainly because of health reasons And that's a valid reason of course from Joe Weider telling them not to change and then seeing all these other you guys getting injured and seeing where they end up I Believe it. I have no reason not to but again. I'll go back to what I was saying I think that at some point in his life He did take some steroids possibly, not just injectables, but oral steroids that don't do as much damage to the body We still get some effects from them, then of course taking specific drugs Maybe he was just taking the ones that help you keep the muscle and stay lean and that's easy to do Then what not to say that this is what a lot of guys are doing that they're possibly just doing short cycles taking small amounts of just oral steroids Maybe and then just going off of that Body adapts to the pressures put under so I will continue to squat and deadlift and go heavy so something that they talk a lot About is training heavy, and that's something that I'm a huge advocate of I mostly every time I'm in the gym I'm training heavy. I I've seen what they say on on social media. What do you want to say about that? And now we see will be what we're talking about with him getting all sweaty My aspect is stay away from all steroids but something else that Mike talks about social media and your character And how people look up to you? So it's pretty clear that most top bodybuilders At least people that are at his level are taking steroids or at least take steroids at one point and I think this is one of the main reasons why steroids are such a Controversy is because people are claiming that they're natural Then we have the rest of us and normal people just looking at them thinking that we can look like that some day even though we realistically can't If you're gonna win a show and that's all you are is that one piece of artwork? And I believe you've got to have something underneath, something very important that he brings about is about being a character Being something that people look up to You gotta have the power to motivate people or inspire them to do something greater than what they're doing right now To win you got to be the best you can be a champion but for longevity is character Talking about social media, and you're trying to stay relevant so what he means by that It's not that you just got to look good Is that you got to be able to talk to people and gotta inspire them to make them feel good And if these kids got character And there's something and they could teach people then I'm fine with them have my two million followers And I'm fine with them being bigger than Mr. Olympia because there's something more to them one great example of a champion right now It's Cederick McMillian many of you already seen the speeches all link one below He truly knows how to talk to an audience so what I'm saying It doesn't really matter whether these guys are on a steroids or not if whatever they're saying makes you feel better It makes you want to do something greater, and that's great go for it alright well I think everyone should be working out if you're looking at these guys And if they motivate you they want to make you go to the gym they want to make you look like him That's great. Well. Simply if you really wanted you got to put in the work You got to go into the gym, you gonna do your cardio, you gotta eat good, build your own Legacy on your own terms in the future take steroids if you want just know what you're getting yourself into But of course everyone should be honest whether if not if they're taking steroids I just like how it's such a taboo for everyone to talk about so do I think all body builders need to be natural no, but you should see what you could do with your natural body with the right eating and correct supplementation I Guarantee if it was more classic physique and pleasant bodies, then we'd get more TV exposure That's why they isn't that the reason they created classic physique to put the genie back in the bottle I think I wanted to talk about classic physique for a little bit as I said on how they said the IFBB created that to put Bodybuilding back into the limelight showing guys with smaller waists and more physiques that the average guy can achieve with these guys not being as big as open body builders I love classic physique And I think that's something that many guys CAN compete at within five years of training without taking steroids I'm not confirming that he's natural but this video of Kelly Brown showing his physique now. He has a great classic physique body He's claiming that he's natural and I believe it from the video he's not that lean he has a lot of muscle, but of course that's just from years of training and Genetics so if you're looking to compete in bodybuilding if you've been working out for a couple of years you should be considering classic physique So it is possible to be really lean with a lot of muscle without taking steroids if you want to have a great body you Gotta put in the effort in the gym. You gotta know what to eat and eat a lot as everybody gets older What do they do get rid of food get rid of food I'm only down to like three meals a day now. I always stay with a large amount of food in calories up This is something very important if you're hitting a plateau Stop caring about abs and just start eating eating, is absolutely important when you want to build muscle and you got the body But you want your walking off point well I hope I got my point across check out the description if you're interested in some gym equipment and Comment below if you want some stickers, I'll send some out to you Peace and so the one thing I try to do is just do my life. I put it out there. It's tough for me I navigate through it all because I I Adapt, and I just listen like I go to the phoebo over in Germany one of the biggest Expos I don't know. I got your blocks, so I don't yeah You"
									}
							],
							"summaries": [
									{
											"blockId": 2,
											"summary": "In this section of the video, the hosts discuss the topic of steroids in bodybuilding and how it affects perceptions of natural physiques. They interview Mike O'Hearn, a former bodybuilder and powerlifter who claims to have stayed natural due to health reasons and advice from Joe Weider. They also discuss the importance of being a character and motivating others in bodybuilding, as well as the creation of classic physique to promote more attainable physiques for the average person. The hosts emphasize the importance of hard work, proper nutrition, and genetics in creating a great body without steroids."
									}
							]
					}
			]
	}
}